In [34]:
import pandas as pd
import numpy as np

In [8]:
names = ['United States', 'Australia', 'Japan', 'India', 'Russia', 'Morocco', 'Egypt']
dr =  [True, False, False, False, True, True, True]
cpc = [809, 731, 588, 18, 200, 70, 45]

In [9]:
my_dict = {'country':names,'drives_right':dr,'cars_per_cap':cpc}

In [10]:
cars = pd.DataFrame(my_dict)

In [11]:
cars.index=["US","AUS","JAP","IND","RUS","MOR","EGY"]

In [12]:
print(cars)

           country  drives_right  cars_per_cap
US   United States          True           809
AUS      Australia         False           731
JAP          Japan         False           588
IND          India         False            18
RUS         Russia          True           200
MOR        Morocco          True            70
EGY          Egypt          True            45

In [12]:
#cars["country"]

US     United States
AUS        Australia
JAP            Japan
IND            India
RUS           Russia
MOR          Morocco
EGY            Egypt
Name: country, dtype: object

In [13]:
#type(cars["country"])

pandas.core.series.Series

In [14]:
cars[["country"]]

           country
US   United States
AUS      Australia
JAP          Japan
IND          India
RUS         Russia
MOR        Morocco
EGY          Egypt

In [15]:
cars[["country","cars_per_cap"]]

           country  cars_per_cap
US   United States           809
AUS      Australia           731
JAP          Japan           588
IND          India            18
RUS         Russia           200
MOR        Morocco            70
EGY          Egypt            45

In [17]:
cars[0:4]

           country  drives_right  cars_per_cap
US   United States          True           809
AUS      Australia         False           731
JAP          Japan         False           588
IND          India         False            18

In [19]:
cars.loc["IND"]

country         India
drives_right    False
cars_per_cap       18
Name: IND, dtype: object

In [20]:
cars.loc[["IND"]]

    country  drives_right  cars_per_cap
IND   India         False            18

In [21]:
cars.loc[["IND","JAP"]]

    country  drives_right  cars_per_cap
IND   India         False            18
JAP   Japan         False           588

In [22]:
cars.loc[["IND","JAP"],["drives_right","country"]]

     drives_right country
IND         False   India
JAP         False   Japan

In [24]:
cars.loc[:,["country","drives_right"]]

           country  drives_right
US   United States          True
AUS      Australia         False
JAP          Japan         False
IND          India         False
RUS         Russia          True
MOR        Morocco          True
EGY          Egypt          True

In [25]:
cars.loc[:,:]

           country  drives_right  cars_per_cap
US   United States          True           809
AUS      Australia         False           731
JAP          Japan         False           588
IND          India         False            18
RUS         Russia          True           200
MOR        Morocco          True            70
EGY          Egypt          True            45

In [28]:
cars.iloc[[1,2,3]]

       country  drives_right  cars_per_cap
AUS  Australia         False           731
JAP      Japan         False           588
IND      India         False            18

In [29]:
cars.iloc[[1,2,3],[0,1]]

       country  drives_right
AUS  Australia         False
JAP      Japan         False
IND      India         False

In [32]:
x=cars["cars_per_cap"]<500

In [33]:
cars[x]

     country  drives_right  cars_per_cap
IND    India         False            18
RUS   Russia          True           200
MOR  Morocco          True            70
EGY    Egypt          True            45

In [38]:
y=np.logical_and(cars["cars_per_cap"]>18,cars["cars_per_cap"]<200)

In [39]:
cars[y]

     country  drives_right  cars_per_cap
MOR  Morocco          True            70
EGY    Egypt          True            45

# Adding columns to panda dataframe

In [42]:
for lab,row in cars.iterrows():
    cars.loc[lab,"COUNTRY"]=row["country"].upper()

In [43]:
print(cars)

           country  drives_right  cars_per_cap        COUNTRY
US   United States          True           809  UNITED STATES
AUS      Australia         False           731      AUSTRALIA
JAP          Japan         False           588          JAPAN
IND          India         False            18          INDIA
RUS         Russia          True           200         RUSSIA
MOR        Morocco          True            70        MOROCCO
EGY          Egypt          True            45          EGYPT

# # Another way of adding columns without forloop

In [48]:
cars["name_length"]=cars["country"].apply(len)

In [49]:
print(cars)

           country  drives_right  cars_per_cap        COUNTRY  name_length
US   United States          True           809  UNITED STATES           13
AUS      Australia         False           731      AUSTRALIA            9
JAP          Japan         False           588          JAPAN            5
IND          India         False            18          INDIA            5
RUS         Russia          True           200         RUSSIA            6
MOR        Morocco          True            70        MOROCCO            7
EGY          Egypt          True            45          EGYPT            5